{
  "about": {
    "bio": "With 8 years of modern frontend development and 4 years of team management experience, I focus on enterprise system architecture and engineering excellence. I have led and participated in the technology selection, architectural refactoring, and performance optimization of more than ten large-scale systems. I possess solid hands-on experience in frontend microservices, component libraries, and automation engineering tools, excel at cross-department collaboration and team growth management, and continuously improve project delivery quality and development efficiency through innovation.",
    "stats": {
      "yearsExperience": "8+",
      "projectsCompleted": "20+",
      "happyClients": "100%",
      "yearsDescription": "Frontend Development & Team Management Experience",
      "projectsDescription": "Large Enterprise System Development",
      "clientsDescription": "Cross-department Collaboration"
    },
    "keyPoints": [
      "Deep expertise in modern frontend architecture and engineering systems, leading multiple complex enterprise system development, architectural refactoring, and team management, achieving high-quality launches and agile delivery.",
      "Excellent team leadership and technical drive, systematically implementing engineering standards, toolchain automation, and knowledge accumulation, building efficient collaborative teams and improving overall R&D experience and delivery efficiency.",
      "Led frontend tech stack upgrades, micro-frontend/Monorepo architectural innovation and unified component library construction, significantly enhancing large application maintainability, scalability, and development efficiency."
    ]
  },
  "skills": {
    "categories": [
      {
        "id": 1,
        "name": "Frontend Fundamentals",
        "icon": "Code",
        "skills": [
          {
            "name": "JavaScript/TypeScript",
            "level": "Expert",
            "description": "8 years of hands-on JavaScript development experience, deep mastery of ES6+ features and mainstream design patterns, understanding of asynchronous programming and type systems. 4 years of TypeScript engineering practice, proficient in leveraging type inference and advanced types to optimize development experience and code robustness in complex systems.",
            "percentage": 95,
            "keywords": ["ES6+", "TypeScript", "HTML5", "CSS3"]
          },
          {
            "name": "React Ecosystem",
            "level": "Expert",
            "description": "6 years of React project leadership experience, understanding the evolution from Class components to Hooks and underlying principles, deep knowledge of virtual DOM and Fiber architecture. Skilled in high-performance optimization for large forms and dynamic lists, comprehensively promoting engineering best practices.",
            "percentage": 95,
            "keywords": ["React", "Hooks", "Redux", "Performance Optimization"]
          },
          {
            "name": "Vue Ecosystem",
            "level": "Expert",
            "description": "Rich experience in Vue 2/3 projects, skilled in localized product development, proficient in reactive system and complex component refactoring with Composition API. Experienced in component library development and system maintenance.",
            "percentage": 90,
            "keywords": ["Vue", "Vuex", "Vue Router", "Component Library"]
          },
          {
            "name": "Performance & Networking",
            "level": "Expert",
            "description": "In-depth understanding of browser rendering principles, V8 optimization, and web application performance tuning. Capable of multi-dimensional resource loading, rendering performance, and network protocol optimization and implementation.",
            "percentage": 90,
            "keywords": ["Performance Optimization", "Browser Principles", "HTTP Optimization", "Resource Loading"]
          },
          {
            "name": "UI Component Development",
            "level": "Expert",
            "description": "Led core design and development of multiple enterprise-level component libraries, including deep secondary development of antd and self-developed component solutions. Skilled in high-performance complex component abstraction and standardized component design systems, driving frontend R&D efficiency and reusability improvement.",
            "percentage": 90,
            "keywords": ["Component Library", "antd", "Performance Components", "Design System"]
          }
        ]
      },
      {
        "id": 2,
        "name": "Engineering Systems",
        "icon": "Zap",
        "skills": [
          {
            "name": "Build & Optimization",
            "level": "Expert",
            "description": "Led deep build performance optimization for several large projects, reducing typical business build time from 8 minutes to 3 minutes. Proficient in advanced Webpack optimization (persistent caching, concurrent builds, etc.), actively introducing Vite to reshape development experience and collaboration speed.",
            "percentage": 95,
            "keywords": ["Webpack", "Vite", "Rollup", "Build Optimization"]
          },
          {
            "name": "Engineering Toolchain",
            "level": "Expert",
            "description": "Comprehensive experience in building and implementing frontend engineering automation systems, driving continuous delivery innovation from CLI, standards, automated testing, to CI/CD integration.",
            "percentage": 90,
            "keywords": ["CLI", "ESLint", "Automated Testing", "CI/CD"]
          },
          {
            "name": "Monorepo Engineering",
            "level": "Expert",
            "description": "Led the introduction of pnpm+Turborepo Monorepo architecture in large system iterations, greatly improving code sharing, efficient dependency management, and independent deployment for multiple product lines, enabling dynamic module integration and agile releases.",
            "percentage": 90,
            "keywords": ["Monorepo", "pnpm", "turborepo", "Engineering"]
          },
          {
            "name": "Micro-Frontend Architecture",
            "level": "Advanced",
            "description": "Led the implementation of qiankun micro-frontend during tech stack upgrades, achieving smooth integration of new and legacy systems and progressive architectural upgrades, significantly enhancing system scalability and independent module evolution.",
            "percentage": 85,
            "keywords": ["Micro-Frontend", "qiankun", "Application Integration", "Tech Upgrade"]
          },
          {
            "name": "Automation Tool Development",
            "level": "Expert",
            "description": "Led the development of productivity plugins for VSCode/Figma, implemented customized AST transformation tools and automation scripts, systematically improving team development efficiency and code consistency.",
            "percentage": 90,
            "keywords": ["VSCode Plugin", "Figma Plugin", "AST", "Code Transformation"]
          }
        ]
      },
      {
        "id": 3,
        "name": "Domain Technologies",
        "icon": "BrainCircuit",
        "skills": [
          {
            "name": "WeChat Work App Development",
            "level": "Expert",
            "description": "Led multi-terminal architecture for WeChat Work, building a highly reusable code system and solving key technical challenges such as capability compatibility, weak network optimization, and secure interaction in the WeChat Work environment.",
            "percentage": 90,
            "keywords": ["WeChat Work JSSDK", "Mini Programs", "H5 Apps", "Multi-terminal Development"]
          },
          {
            "name": "Data Visualization",
            "level": "Advanced",
            "description": "Deep application of ECharts and large-scale Pixi.js graphics engines, achieving high-performance data visualization and interaction, with architectural capability to support complex multi-dimensional data large-scale rendering and editing.",
            "percentage": 85,
            "keywords": ["ECharts", "Pixi.js", "Graphics Rendering", "Interaction Design"]
          },
          {
            "name": "Internationalization System",
            "level": "Expert",
            "description": "Led the design of frontend internationalization solutions, covering multi-language, dynamic loading, localization adaptation, and copy consistency management, continuously providing high-standard internationalization support for multiple global products.",
            "percentage": 90,
            "keywords": ["i18next", "Multi-language", "Localization", "Copy Management"]
          },
          {
            "name": "Frontend Monitoring",
            "level": "Advanced",
            "description": "Built enterprise-level frontend performance and exception monitoring systems, integrated Sentry, Web Vitals, Grafana, etc., to quantify user experience in real time and drive full-link performance optimization and stability operations.",
            "percentage": 85,
            "keywords": ["Performance Monitoring", "Error Tracking", "User Behavior", "Monitoring Alerts"]
          }
        ]
      }
    ]
  },
  "experiences": [
    {
      "id": 1,
      "company": "Beijing LingYue Technology",
      "position": "Frontend Engineer",
      "location": "Beijing",
      "period": "Mar 2019 - Present",
      "description": "Led frontend architecture upgrades, performance optimization, and engineering system implementation. Built unified component libraries and automation toolchains to enable efficient cross-department collaboration. Deeply involved in the refactoring of multiple large-scale systems, technical team management, and efficiency innovation, continuously enhancing technical influence and business agility.",
      "items": [
        {
          "id": "oa-1",
          "title": "Domestic OA (React)",
          "type": "OA System and Derivative Product Line",
          "category": "Business Systems",
          "period": "Mar 2020 - Present",
          "position": "Architect",
          "summary": "High-performance OA system frontend development based on React, Webpack, Vite, WebSocket, Ant Design, i18next, Redux, Redux-Saga. Led performance optimization, internationalization, visual configuration, WebSocket optimization, security hardening, build optimization, and performance monitoring.",
          "achievements": [
            {
              "id": "star-101",
              "title": "List Performance Optimization",
              "situation": "Core module contained ultra-large lists, resulting in slow initial rendering and page switching response, affecting user experience fluidity.",
              "task": "Optimize initial rendering performance and improve response speed in large data scenarios.",
              "action": "Introduced virtual list and lazy loading strategies, used React Profiler for precise bottleneck identification, refactored complex form components, and adopted react-lazy-with-preload for route lazy loading, achieving end-to-end performance improvement.",
              "result": "Large list average rendering time optimized to 800ms, page switching response improved by 40%, overall user experience significantly enhanced."
            },
            {
              "id": "star-102",
              "title": "Multi-language Support Solution",
              "situation": "Rapid business expansion required multi-language adaptation to enhance international market capabilities.",
              "task": "Implement flexible and scalable frontend internationalization solution to eliminate code switching and copy synchronization issues.",
              "action": "Integrated i18next and JSON dynamic language packs, built multi-language configuration and auto-loading mechanisms, improved multi-dimensional localization formats and real-time monitoring to ensure translation completeness and accuracy.",
              "result": "System launched with 4 languages, translation errors reduced by 95% compared to original, supporting rapid international promotion and significantly enhancing product competitiveness."
            },
            {
              "id": "star-103",
              "title": "Workspace Map Configuration Process Optimization",
              "situation": "Traditional workspace configuration process was cumbersome with high collaboration costs and long development and configuration iteration cycles.",
              "task": "Empower business departments through automation and visualization tools to improve overall configuration efficiency.",
              "action": "Developed Figma plugin for automatic configuration extraction, followed by building a visual workspace configuration platform, achieving process closed-loop and cost reduction.",
              "result": "Total configuration time reduced from 4.5 person-days to 0.5 person-days, greatly reducing error rates and labor consumption."
            },
            {
              "id": "star-104",
              "title": "WebSocket Real-time Function Optimization",
              "situation": "Real-time communication faced high latency and disconnection issues, affecting critical message delivery and business linkage.",
              "task": "Improve WebSocket communication quality and business real-time assurance.",
              "action": "Designed exponential backoff auto-reconnect and MessagePack data compression strategies, optimized heartbeat detection and message flow, fully covering notification/collaboration core scenarios.",
              "result": "Average message delay reduced by 40%, instant sync experience achieved breakthrough, user real-time perception issues decreased by 80%."
            },
            {
              "id": "star-105",
              "title": "Frontend Security Enhancement",
              "situation": "OA system contained sensitive data, requiring higher frontend security standards.",
              "task": "Comprehensively strengthen frontend security protection and avoid mainstream vulnerability risks.",
              "action": "Implemented CSP, escape validation, CSRF Token, and sensitive data watermarking, established complete security audit process.",
              "result": "Zero major vulnerability risks, significantly improved security score, notable reduction in sensitive data security incidents."
            },
            {
              "id": "star-106",
              "title": "Build Optimization and Developer Experience Improvement",
              "situation": "After engineering complexity increased, Webpack builds and local hot updates became slow, affecting development efficiency.",
              "task": "Reduce build and local development startup time, improve team coding experience.",
              "action": "Deep optimization of Webpack multi-core, cache, tree-shaking configuration, introduced Vite to accelerate local development environment, improved code hot update process.",
              "result": "Compilation build time reduced by 35%, local startup efficiency improved by 90%."
            },
            {
              "id": "star-107",
              "title": "Performance Monitoring System Setup",
              "situation": "Lack of real-time performance/exception monitoring made it difficult to proactively discover and address potential issues.",
              "task": "Establish end-to-end performance and business availability automated monitoring and alerting system.",
              "action": "Integrated Sentry, Web Vitals, and custom business tracking, connected to Grafana visualization and alerts, promoting proactive warning and optimization mechanisms.",
              "result": "Performance data became real-time traceable, issue self-discovery rate increased by 60%, overall launch quality and stability continuously enhanced."
            }
          ]
        },
        {
          "id": "oa-2",
          "title": "WeChat Work Application",
          "type": "OA System and Derivative Product Line",
          "category": "Business Systems",
          "period": "May 2024 - Dec 2024",
          "position": "Architect",
          "summary": "Led the design of multi-terminal business architecture supporting both PC and mobile, achieving 70% business code and UI component consistency and sharing across platforms through Monorepo and cross-terminal component abstraction. Promoted unified standards, toolchains, and development best practices, significantly improving team delivery efficiency.",
          "achievements": [
            {
              "id": "star-108",
              "title": "Cross-platform Technical Architecture Design",
              "situation": "Needed to efficiently deliver both PC and mobile WeChat Work applications while reducing redundant and inconsistent development.",
              "task": "Build highly reusable, unified multi-terminal architecture and component library.",
              "action": "Managed through pnpm Monorepo, accumulated common Hooks and responsive components, coupled with strict lint rules to ensure code consistency.",
              "result": "Cross-platform core reuse rate reached 70%, new feature development cycle shortened by 30%, multi-terminal collaboration experience significantly improved."
            },
            {
              "id": "star-109",
              "title": "Mobile Performance Optimization",
              "situation": "Mobile white screen and network latency affected business promotion and user experience.",
              "task": "Break through weak network loading bottlenecks, significantly improve mobile first screen performance.",
              "action": "Optimized data preloading, HTTP caching, resource splitting and on-demand loading, implemented react-query integration and dynamic resource prioritization strategy.",
              "result": "Core pages P95 white screen duration reduced by 50%, achieving industry-leading mobile access smoothness."
            }
          ]
        },
        {
          "id": "oa-3",
          "title": "Indonesian OA (Vue)",
          "type": "OA System and Derivative Product Line",
          "category": "Business Systems",
          "period": "",
          "position": "Core Developer",
          "summary": "Led the localized OA system development for Indonesian department, achieving high-standard delivery through rapid component adaptation, complex network environment optimization, and cross-team resource integration.",
          "achievements": [
            {
              "id": "star-110",
              "title": "Rapid Localization Development",
              "situation": "Needed to quickly launch OA system for Indonesian market, with functionality similar to domestic version but requiring localization.",
              "task": "Quickly complete Indonesian version development using Vue based on domestic React experience.",
              "action": "Adopted Vue 2, Webpack, Ant Design Vue (antdv) tech stack; reused domestic version design and architecture; focused on developing date and number formatting components for Indonesian users; wrapped antdv rich text editor with tiptap for business needs.",
              "result": "Successfully launched Indonesian OA system within 2 months, rich text module development efficiency improved by 65% compared to using native tiptap."
            },
            {
              "id": "star-111",
              "title": "Indonesian Network Environment Optimization",
              "situation": "Weak network conditions and browser fragmentation affected access speed and compatibility.",
              "task": "Systematically optimize weak network performance and mainstream compatibility.",
              "action": "Employed HTTP/2, CDN edge caching, WebP images and async loading of key resources, ensuring compatibility with local mainstream browsers.",
              "result": "FMP reduced by 60%, achieved 99% compatibility in mainstream environments."
            }
          ]
        },
        {
          "id": "oa-4",
          "title": "Frontend Engineering System Upgrade",
          "type": "OA System and Derivative Product Line",
          "category": "Business Systems",
          "period": "Oct 2024 - Present",
          "position": "Architect",
          "summary": "Comprehensively promoted the evolution of OA/OMS/KMG and other large monolithic architectures towards Monorepo + micro-frontend direction, decoupling business in phases, cleaning up technical debt, and improving engineering collaboration efficiency, enabling independent iteration and agile delivery of business lines.",
          "achievements": [
            {
              "id": "star-112",
              "title": "Monorepo Architecture Refactoring",
              "situation": "System capability and evolution were slow: current OA was a large monolithic application with OMS/ECOMS/KMG variants, code coupling led to low iteration efficiency, high maintenance costs, and low CI/CD efficiency (8 minutes per build).",
              "task": "Refactor system architecture to improve module independence and reusability, supporting rapid iteration of each product line.",
              "action": "Carefully designed three-phase split plan: 1) Initialized Monorepo with pnpm+Turborepo, separated OMS code to packages/oms, extracted shared code to shared-core and shared-legacy-ui; 2) Created oms-next with modern tech stack (React 18/AntD 5), configured micro-frontend integration with old oms; 3) Gradually rewrote old features based on slimfit component library by module.",
              "result": "Average project build time reduced by 50%, product lines can iterate and release independently, shared module changes automatically sync to dependent projects, reducing maintenance costs."
            },
            {
              "id": "star-113",
              "title": "Micro-frontend Progressive Migration",
              "situation": "Legacy tech stack (React 16/AntD 4) needed upgrade to modern stack (React 18/AntD 5), but couldn't interrupt business operations, requiring smooth transition.",
              "task": "Design progressive migration plan to ensure smooth transition.",
              "action": "Evaluated and adopted qiankun micro-frontend framework (compared with MF and internal solutions), configured oms-next as main app and old oms as sub-app; designed routing integration and gradual module/page replacement strategy; built main-sub app communication mechanism ensuring cross-app data consistency; designed comprehensive test cases to verify new-old system integration stability.",
              "result": "Successfully achieved progressive migration, system performance improved by 40% after new architecture launch, frontend development efficiency increased by 30%."
            },
            {
              "id": "star-114",
              "title": "Technical Debt Cleanup",
              "situation": "System had long history with accumulated technical debt: multiple component library versions coexisting, Class and functional components mixed, two versions of permission check functions, numerous conditional statements, leading to high maintenance costs and slow feature iteration.",
              "task": "Systematically clean up technical debt to improve code quality and maintainability.",
              "action": "Used structured methods to manage variant differences (based on .env and config.ts instead of if/else conditionals); extracted complex business logic to shared packages (shared-core/shared-legacy-ui); unified to Slimfit component library; upgraded permission check system to support data permission points and role judgment; wrote automated code conversion scripts for batch refactoring of legacy code.",
              "result": "Code repository size reduced by 30%, component call consistency improved by 90%, permission logic errors reduced by 85%, development team's time for understanding and modifying permission-related code reduced by 70%."
            }
          ]
        },
        {
          "id": "wp-1",
          "title": "WP Series Projects",
          "category": "Business Systems",
          "period": "Jun 2023 - Mar 2024",
          "position": "Lead Frontend Developer",
          "summary": "Complex graphic display and editing functionality development based on React, UMI, Tailwind CSS, leading high-performance rendering, complex interaction, and component reuse.",
          "achievements": [
            {
              "id": "star-120",
              "title": "High-performance Graphic Rendering",
              "situation": "Project needed to develop complex parking lot map and warehouse map configuration interfaces, requiring high-performance rendering and interaction.",
              "task": "Implement high-performance, configurable graphic display and editing features.",
              "action": "Developed with React, UMI, Tailwind CSS; reused and extended Pixi.js graphics rendering engine experience from OA project, optimized rendering performance for large data volumes.",
              "result": "Successfully delivered parking lot and warehouse map configuration functionality, supporting smooth display and interaction of 1000+ graphic elements."
            },
            {
              "id": "star-121",
              "title": "Complex Interaction Optimization",
              "situation": "Graphic editing interface needed to support box selection and dragging of large-scale elements with high performance requirements.",
              "task": "Implement high-performance box selection and multi-element operation functionality.",
              "action": "Optimized box selection algorithm, used requestAnimationFrame to throttle redraws; implemented batch processing and asynchronous handling of large-scale element operations to avoid UI thread blocking.",
              "result": "Achieved smooth box selection experience, supporting simultaneous operation of 1000+ elements, user operation efficiency improved by 50%, Grafana monitoring shows P95 interaction response time stable within 200ms."
            }
          ]
        },
        {
          "id": "fin-1",
          "title": "Capital/Finance/Risk Control Systems",
          "category": "Business Systems",
          "period": "Jun 2019 - Dec 2021",
          "position": "Frontend Lead",
          "summary": "As frontend lead, designed financial-grade secure and compliant capital system architecture from scratch, led business component abstraction and automation migration tool development, quickly completed technology upgrades and ensured high-quality delivery.",
          "achievements": [
            {
              "id": "star-130",
              "title": "Financial Application Security Development",
              "situation": "Building capital, finance, and risk control systems from scratch to meet financial business requirements.",
              "task": "As frontend lead, lead system frontend technology selection, architecture design, and core functionality development.",
              "action": "Selected Vue 2 and internal Base-UI component library as foundation technology stack; followed frontend security best practices (input validation, output encoding, HTTPS, etc.) for development.",
              "result": "System successfully launched on schedule, passed internal security department audit, met financial-grade application security requirements, no major security incidents in first year after launch."
            },
            {
              "id": "star-131",
              "title": "Component Library Migration Tool",
              "situation": "Company technology stack upgrade required migrating old system UI from Base-UI to new standard component library @yqg/antd.",
              "task": "Efficiently and accurately complete UI component library migration work.",
              "action": "Analyzed API differences between two component libraries, developed AST-based code conversion tool to automatically identify and replace old component usage with new component API calls.",
              "result": "Tool automated over 80% of page migration workload, overall migration cycle shortened by 50%, greatly reduced repetitive manual operations."
            },
            {
              "id": "star-132",
              "title": "Business Component Encapsulation",
              "situation": "System contained many structurally similar CRUD pages, development efficiency needed improvement.",
              "task": "Improve basic page development efficiency and performance.",
              "action": "Encapsulated page-level business components (search forms, data tables, modal forms), standardized development process.",
              "result": "Basic CRUD page development efficiency improved by 50%, core report page loading and interaction performance improved by 35%."
            }
          ]
        },
        {
          "id": "inf-1",
          "title": "Slimfit Component Library",
          "type": "",
          "category": "Infrastructure",
          "period": "Oct 2024 - Present",
          "position": "Architect",
          "summary": "Designed and built a corporate standard React component library based on antd 5 to address UI inconsistency and component duplication across multiple B-end products, incorporating company design specifications and innovatively implementing theme engine, icon system, font standards, and Tailwind integration solutions, significantly improving internal development efficiency.",
          "achievements": [
            {
              "id": "inf-1-1",
              "title": "Unified Design Specification",
              "situation": "Company B-end products were still using AntD 4 era UI with outdated visual styles; teams repeatedly performed style customizations with low efficiency and high error rates; specific design specifications (color palette, fonts, icon system) were difficult to systematically implement.",
              "task": "Lead the development of the company's new generation standard React component library Slimfit to unify design specifications.",
              "action": "Designed innovative theme engine to inject design specifications into antd 5; defined antdTokenOverrides and customTokens in src/theme/tokens.ts to inject all design standard colors; defined componentOverrides in src/theme/components.ts for fine component adjustments; used father 4 (Rollup) for component packaging and dumi 2 for documentation site building.",
              "result": "Slimfit became the standard component library for the company's B-end product line, effectively unifying product visual styles and enhancing brand consistency."
            },
            {
              "id": "inf-1-2",
              "title": "Custom Icon System",
              "situation": "Company needed to modify Arco icons (such as line thickness) and add numerous internal-specific icons, which couldn't be met by directly depending on the original library.",
              "task": "Build a unified enterprise-level icon system.",
              "action": "Built an internal icon system in slimfit: maintained SVG source files in src/icons/svgs/ directory; created BaseIcon component providing unified props and default styles (fill, stroke, width, etc.); developed automation tools to convert SVGs to React components; unified visual attributes like line thickness and alignment.",
              "result": "Centralized icon asset management with unified styles, easy addition and modification, simple and consistent developer usage, providing a unified icon solution for 40+ internal projects."
            },
            {
              "id": "inf-1-3",
              "title": "Multi-tech Stack Compatibility",
              "situation": "Projects using Tailwind CSS within the company might have conflicts with antd custom styles; needed to ensure all projects uniformly applied the specified brand fonts.",
              "task": "Design a cross-tech stack design specification sharing mechanism.",
              "action": "Developed font management solution: created standalone fonts.css and hosted font files; built innovative Tailwind Preset: created tailwind.preset.js to map slimfit tokens to Tailwind configuration (colors, border radius, spacing, etc.), supporting one-line code import of all design specifications; implemented one-click configuration SlimfitProvider component.",
              "result": "Greatly simplified the process for different tech stack projects to adopt design specifications, reduced overall visual differences in B-end products by 30%, shortened new project onboarding time by 50%, and increased design satisfaction by 25%."
            }
          ]
        },
        {
          "id": "inf-2",
          "title": "Base-UI Component Library",
          "type": "",
          "category": "Infrastructure",
          "period": "Jan 2019 - May 2021",
          "position": "Core Developer",
          "summary": "Participated in building the company's first-generation Vue 2 component library Base-UI, responsible for developing table row/column freezing functionality, using virtual lists to optimize performance with large data volumes, and switching the packaging tool from Webpack to Rollup to optimize component library size and loading performance.",
          "achievements": [
            {
              "id": "inf-2-1",
              "title": "High-performance Component Development",
              "situation": "Early Vue projects lacked high-quality, high-performance chart, selector, and other basic components.",
              "task": "As a core developer, participate in building the company's first-generation Vue 2 component library Base-UI.",
              "action": "Responsible for developing table row/column freezing functionality; used virtual list technology to optimize performance of Select, TreeSelect, and other components when handling large data volumes.",
              "result": "Successfully encapsulated over 50 UI components, component reuse rate in company internal projects reached 60%, Select and similar components support smooth rendering of over 10,000 data items, performance improved by 200%."
            },
            {
              "id": "inf-2-2",
              "title": "Component Library Package Optimization",
              "situation": "Component library used Webpack for packaging, resulting in large size and slow loading.",
              "task": "Optimize component library packaging method to reduce size and improve loading performance.",
              "action": "Switched packaging tool from Webpack to Rollup, leveraging its good support for ES Modules and better tree-shaking effect; configured output in multiple module formats (ESM, CJS).",
              "result": "Overall component library package size reduced by 15%, on-demand loading effect improved, projects using the library saw average first screen loading speed improvements of 30%."
            }
          ]
        },
        {
          "id": "tool-1",
          "title": "Development Scripts & Toolchain Construction",
          "type": "",
          "category": "Engineering Efficiency",
          "period": "Mar 2021 - Present",
          "position": "Engineering Lead",
          "summary": "Led the construction of full-process automation toolchain and standard template systems, greatly simplifying new project initialization, engineering upgrades, and environment configuration for new team members, achieving efficient collaboration and stable delivery.",
          "achievements": [
            {
              "id": "tool-1-1",
              "title": "Project Template Standardization",
              "situation": "Project initialization configuration was cumbersome, local development environment startup was slow, and Webpack build configuration was complex.",
              "task": "Improve frontend engineering efficiency and developer experience.",
              "action": "Developed standardized project templates (React/Vue/Node); deeply optimized Webpack build configurations (caching, DllPlugin, etc.); introduced and promoted Vite and esbuild next-generation build tools; created project initialization scripts for automatic setup of basic configurations, Git Hooks, and dependency installation.",
              "result": "New project initialization time reduced from 30 minutes to 5 minutes; local development server startup time decreased by average of 70%; developer satisfaction with engineering toolchain improved by 50%."
            },
            {
              "id": "tool-1-2",
              "title": "New Employee Onboarding Optimization",
              "situation": "After joining project teams, new employees took a long time to familiarize with project tech stacks and development processes; development environment configuration was complicated and error-prone.",
              "task": "Optimize new employee onboarding and familiarization experience, simplify environment configuration.",
              "action": "Systematically organized technical documentation for each project team, supplementing missing content; wrote new employee onboarding guide covering environment configuration, development processes, and common issues; developed Homebrew-based one-click environment configuration script (setup.sh) to automatically install required software packages (Node.js, Docker, Git, etc.) and complete basic configurations like Git config, SSH key generation, npm registry settings, etc.",
              "result": "Average time for new employees to independently take on development tasks reduced from 2 weeks to 3 days; environment configuration time decreased from half a day to 15 minutes, significantly reducing frustration in initial onboarding period; environment configuration-related issues reduced by 75%."
            },
            {
              "id": "tool-1-3",
              "title": "Automated Code Migration Tools",
              "situation": "During project tech stack upgrades (e.g., React 16 to 18, Antd 4 to 5), manual adjustment of APIs and component usage required enormous effort.",
              "task": "Build automation tools to simplify upgrade process and reduce error rates.",
              "action": "Developed series of Node.js scripts using AST technology to automatically identify and replace outdated APIs; built project dependency graph analysis tools to identify potential impact scope; wrote specific conversion rules for common libraries like antd and react-router; designed batch execution and rollback mechanisms to ensure controllable conversion process.",
              "result": "Code adjustment workload for React 18 upgrade projects reduced by 70%, with automation completing work that would have required manually replacing about 1000 code points; detection rate of incorrect API usage increased to 95%, avoiding numerous potential runtime errors."
            }
          ]
        },
        {
          "id": "tool-2",
          "title": "Figma Extension Development",
          "type": "",
          "category": "Engineering Efficiency",
          "period": "Jun 2022 - Present",
          "position": "Tooling Lead",
          "summary": "Developed Figma plugins to enable one-click extraction of design elements and conversion to Pixi.js scene configuration JSON or React/Vue component code, significantly improving development efficiency and design fidelity.",
          "achievements": [
            {
              "id": "tool-2-1",
              "title": "Design-to-Code Tool",
              "situation": "Design drafts required manual conversion to code or configuration by frontend engineers, resulting in low efficiency and high error rates.",
              "task": "Automate the design-to-code/configuration conversion process.",
              "action": "Developed Figma plugin for one-click extraction and conversion of design elements (such as layers and styles) to Pixi.js scene configuration JSON or basic React/Vue component code.",
              "result": "Development efficiency for specific scenarios (like Pixi.js configuration generation) improved by 100%, design fidelity improved by 40%."
            }
          ]
        },
        {
          "id": "tool-3",
          "title": "VSCode Extension Development",
          "type": "",
          "category": "Engineering Efficiency",
          "period": "Aug 2020 - Present",
          "position": "Tooling Lead",
          "summary": "Independently developed full suite of VSCode extensions and toolchains, covering template generation, batch refactoring, and dependency analysis, improving team collaboration and large system maintenance efficiency.",
          "achievements": [
            {
              "id": "tool-3-2",
              "title": "Franky",
              "situation": "Daily development involved many repetitive operations and template code writing needs.",
              "task": "Develop VSCode plugin to improve development efficiency and convenience.",
              "action": "Developed Franky plugin with three core features: 1) fileheader automatic generation and update; 2) one-click generation of Tailwind CSS class names from Figma styles; 3) dynamic template system supporting local/remote template repositories, code generation after variable filling through WebView. All features work out of the box without additional configuration.",
              "result": "Developer daily coding efficiency improved by average of 45%, template code generation time reduced by 90%, style restoration accuracy improved by 60%."
            },
            {
              "id": "tool-3-3",
              "title": "WebBar",
              "situation": "Development process required frequent switching between different systems, documentation lookup and internal tool usage, leading to frequent context switching.",
              "task": "Simplify access to common resources, reduce context switching in workflow.",
              "action": "Developed WebBar VSCode plugin, adding customizable buttons to editor status bar for one-click access to common web pages; supported custom configuration and group management of links; implemented simple browser preview functionality within plugin to avoid window switching.",
              "result": "Developer workflow context switching time reduced by 35%, common resource access efficiency improved by 70%, time for new colleagues to familiarize with internal systems shortened by 50%."
            },
            {
              "id": "tool-3-4",
              "title": "CodeTransformer",
              "situation": "During code refactoring and upgrades, large amount of repetitive code conversion work needed to be done manually, time-consuming and error-prone.",
              "task": "Build code transformation tool within VSCode to improve code refactoring efficiency and accuracy.",
              "action": "Developed CodeTransformer plugin, integrating Babel for rapid code refactoring, supporting Chinese search, dependency graph analysis and other advanced features; provided visual operation interface, supporting official and custom babel plugins; implemented dependency graph visualization and analysis, ensuring no code migration omissions by combining with tsconfig path mapping.",
              "result": "Code refactoring efficiency improved by 400%, specific conversion tasks (like component library API upgrade) accuracy reached 95%, large project dependency analysis time reduced from hours to minutes level, became key tool for team technology upgrades."
            },
            {
              "id": "tool-3-5",
              "title": "Automated Code Migration Tool",
              "situation": "Facing large-scale tech stack upgrades or codebase refactoring, manual migration workload was huge and error-prone.",
              "task": "Develop automation tools to assist code migration.",
              "action": "Developed code static analysis and automatic conversion tools based on Babel and jscodeshift; wrote codemod scripts for specific migration scenarios; integrated into CodeTransformer plugin for visual operation.",
              "result": "Migration efficiency improved by average of 400% in multiple code migration projects, number of bugs introduced by migration reduced by 90%."
            }
          ]
        }
      ]
    },
    {
      "id": 3,
      "company": "Fang.com",
      "position": "Lead Developer / Frontend Developer",
      "location": "Beijing",
      "period": "Nov 2017 - Mar 2019",
      "description": "Responsible for full-process frontend and data visualization product development across multiple business systems, leading technical architecture, performance improvement, and standardization, driving product R&D automation and engineering collaboration efficiency upgrades.",
      "items": [
        {
          "id": "fang-1",
          "title": "Sanfang Campaign",
          "period": "Nov 2017 - Mar 2019",
          "position": "Lead Developer",
          "category": "Business Systems",
          "summary": "Independently responsible for project construction, integrating Webpack bundling and Babel compilation, optimizing build process, improving development efficiency by 20%. Developed Web layer Controllers using Express framework, designed and implemented stable and efficient API services. Built frontend pages with Vue and Vue-router, achieving dynamic routing and smooth interactions, enhancing user experience.",
          "achievements": [
            {
              "id": "fang-1-1",
              "title": "Build Process Optimization",
              "situation": "Initial project build scripts were cumbersome, affecting development efficiency.",
              "task": "Streamline build process and achieve automation.",
              "action": "Optimized build scripts through Webpack+Babel integration, improving development experience.",
              "result": "Efficiency improved by 20%, with enhanced build quality and stability."
            },
            {
              "id": "fang-1-2",
              "title": "Efficient API Service Design",
              "situation": "Business APIs needed to support high concurrency and stability requirements.",
              "task": "Develop high-performance and stable API services.",
              "action": "Built Web Controllers using Express framework, optimized API structure and performance.",
              "result": "API services performed excellently, supporting high concurrent traffic with ease."
            }
          ]
        },
        {
          "id": "fang-2",
          "title": "Land Acquisition Assistant",
          "period": "Nov 2017 - Mar 2019",
          "position": "Frontend Developer",
          "category": "Business Systems",
          "summary": "Led the development of land/location search pages and data visualization features, implemented localStorage persistence and highly reusable condition components, integrated AMap and ECharts for interactive and data visualization upgrades.",
          "achievements": [
            {
              "id": "fang-2-1",
              "title": "User Experience Enhancement",
              "situation": "User switching/saving search operations were cumbersome, affecting perception.",
              "task": "Improve usability and interaction experience of search pages.",
              "action": "Optimized localStorage persistence and interaction flows.",
              "result": "Significantly improved operation convenience, receiving unanimous business praise."
            },
            {
              "id": "fang-2-2",
              "title": "Component Standardization & Development Efficiency",
              "situation": "Page development cycles were long, low component reuse affected collaborative development.",
              "task": "Standardize interactions and component implementation to accelerate development progress.",
              "action": "Encapsulated condition area components and interaction protocols based on Element-UI.",
              "result": "Development cycle shortened by 30%, with improved component reuse and standardization capabilities."
            }
          ]
        },
        {
          "id": "fang-3",
          "title": "City Map",
          "period": "Nov 2017 - Mar 2019",
          "position": "Frontend Developer",
          "category": "Business Systems",
          "summary": "Led the development of economic, population, and potential customer big data pages and backend APIs. Initially implemented interaction logic with jQuery to ensure stable page functionality. Integrated Jihai Map and ECharts for data visualization, meeting multi-dimensional business analysis needs. Later introduced Vue for general condition components and PPT download modules, and used Express for Excel file upload/download, optimizing data processing efficiency.",
          "achievements": [
            {
              "id": "fang-3-1",
              "title": "Multi-dimensional Data Visualization",
              "situation": "Needed to display economic, population, and other multi-dimensional big data.",
              "task": "Achieve efficient data visualization display.",
              "action": "Integrated Jihai Map and ECharts, developed multi-dimensional data visualization pages.",
              "result": "Met business multi-dimensional analysis needs, enhancing data insight capabilities."
            },
            {
              "id": "fang-3-2",
              "title": "General Components & Automation Enhancement",
              "situation": "Page extensibility and data processing efficiency needed improvement.",
              "task": "Enhance page reusability and data processing automation.",
              "action": "Introduced Vue framework, developed general condition components and PPT download module, implemented Excel upload/download with Express.",
              "result": "Enhanced page reusability and significantly improved data processing efficiency."
            }
          ]
        }
      ]
    },
    {
      "id": 4,
      "company": "Sky Blue Software Service Co., Ltd.",
      "position": "Java Developer",
      "location": "Shenzhen",
      "period": "Jul 2016 - Sep 2017",
      "description": "Responsible for secondary development and big data optimization of full-stack SaaS projects, including backend API, database modeling, and high-performance frontend pages, ensuring personalized delivery and key performance improvements.",
      "items": [
        {
          "id": "tl-1",
          "title": "SaaS Project Secondary Development",
          "period": "Jul 2016 - Sep 2017",
          "position": "Java Developer & Full-stack Engineer",
          "category": "Business Systems",
          "summary": "Independently responsible for SaaS product customization and performance improvements, including Java+Spring backend development, jQuery frontend development, and big data batch operation modules, delivering high-quality solutions for industry clients.",
          "achievements": [
            {
              "id": "tl-1-1",
              "title": "ERM System Secondary Development",
              "situation": "Clients required deep customization for ERM business scenarios.",
              "task": "Customize business processes and high-performance data batch processing.",
              "action": "Coordinated multi-module backend development with Java+Spring, improved frontend interactions with jQuery, optimized database and storage.",
              "result": "Project delivered ahead of schedule, significantly optimized response for millions of records, received excellent client feedback and continued cooperation."
            }
          ]
        }
      ]
    },
    {
      "id": 5,
      "company": "Hailan Group",
      "position": "Store Manager / Regional Supervisor",
      "location": "Wuxi",
      "period": "Jul 2014 - May 2016",
      "description": "Led regional market operations and new store opening process optimization, promoted information system implementation and digital management upgrades, achieving business automation and data-driven decision support.",
      "items": [
        {
          "id": "hl-1",
          "title": "Store Inventory Management System",
          "period": "Feb 2016 - May 2016",
          "position": "Regional Supervisor",
          "category": "",
          "summary": "Developed Java+JSP-based store inventory management system, automating warehouse and store data synchronization, improving inventory check accuracy and automation capabilities.",
          "achievements": [
            {
              "id": "hl-1-1",
              "title": "Inventory Process Optimization",
              "situation": "Manual inventory calculations were error-prone, monthly checks were inaccurate.",
              "task": "Automate inventory processes to reduce errors.",
              "action": "Designed barcode scanner automatic data collection and data synchronization modules.",
              "result": "Error rate reduced by 75%, discrepancy rate decreased to 0.8%, improved headquarters data-driven decision-making capability."
            }
          ]
        },
        {
          "id": "hl-2",
          "title": "New Store Opening Process Automation",
          "period": "Sep 2014 - Feb 2016",
          "position": "Store Manager",
          "category": "",
          "summary": "Optimized new store opening process, developed Java+JSP-based TODO-LIST system using Eisenhower Matrix to display tasks by urgency/importance, replacing previous management based on personal experience and notes, improving work efficiency, ensuring all tasks completed within two months before store opening.",
          "achievements": [
            {
              "id": "hl-2-1",
              "title": "New Store TODO-LIST System Development",
              "situation": "New store openings required coordination and tracking of numerous preparation tasks, manual management was inefficient and prone to missing critical items.",
              "task": "Develop simple and efficient task management system to ensure orderly preparation for new store openings.",
              "action": "Developed Web-based task tracking system using Java+JSP, employing Eisenhower Matrix (urgent & important/important not urgent/urgent not important/neither urgent nor important) to display tasks; implemented automatic task scheduling, reminders, and statistics; designed red-yellow-green warning mechanism for intuitive display of task status and urgency.",
              "result": "Task completion rate during preparation period increased from 82% to 98%, average preparation cycle shortened by 3 days, coordination communication time reduced by 60%, system successfully applied in 35 new store openings nationwide, received group recognition."
            }
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "id": 1,
      "degree": "Bachelor's Degree",
      "field": "Agricultural Resources and Environment",
      "institution": "Jilin University",
      "location": "Jilin",
      "period": "Sep 2010 - Jul 2014"
    }
  ],
  "portfolioProjects": [
    {
      "id": 1,
      "title": "What I Don't Know Weekly",
      "description": "AI-driven frontend technology weekly newsletter, curating and deeply interpreting high-quality content from the Web frontend and surrounding ecosystem. Covers practical tools, open-source projects, cutting-edge news, and best practices. Utilizes AI technology for intelligent analysis and content filtering, enabling developers to continuously access high-quality frontend information, enhancing professional skills and technical vision.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035b3218ba2.webp",
      "technologies": ["Astro", "React", "OpenAI", "Tailwind CSS", "Vercel", "MCP", "Node.js"],
      "techIds": ["astro", "react", "openai", "tailwind", "vercel", "mcp", "nodejs"],
      "liveLink": "https://weekly.mengpeng.tech",
      "repoLink": "https://github.com/NorthSeacoder/weekly",
      "featured": true,
      "evolution": ["Manual Content Curation", "AI-Assisted Filtering", "OpenAI API Integration", "Local MCP Service Driven"],
      "related": [4]
    },
    {
      "id": 2,
      "title": "@nsea/xmind-handler",
      "description": "Professional XMind content batch processing tool, supporting efficient topic filtering, format conversion, and multi-format export. Can automatically generate structured JSON/Markdown/streamlined XMind networks, greatly improving mind map content organization and knowledge archiving efficiency.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035be67ab0d.webp",
      "technologies": ["Node.js", "TypeScript", "CLI", "XMind SDK"],
      "techIds": ["nodejs", "typescript", "cli", "xmind"],
      "liveLink": "https://www.npmjs.com/package/@nsea/xmind-handler",
      "repoLink": "https://github.com/NorthSeacoder/xmind-handler",
      "featured": true,
      "evolution": ["Node Filtering", "Multi-format Conversion", "Command Line Tool"],
      "related": [4]
    },
    {
      "id": 3,
      "title": "@codetransformer/find-chinese",
      "description": "Efficient and precise multi-level dependency scanning and Chinese character locator tool, empowering complex frontend projects for internationalization transformation and character review, improving multilingual project development and quality control capabilities.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035e78c6dd6.webp",
      "technologies": ["TypeScript", "AST", "Babel", "VSCode API"],
      "techIds": ["typescript", "ast", "babel", "vscode"],
      "liveLink": "https://www.npmjs.com/package/@codetransformer/find-chinese",
      "repoLink": "https://github.com/NorthSeacoder/codetransformer",
      "featured": true,
      "evolution": ["Basic Scanning", "Dependency Tracking", "Statistical Analysis"],
      "related": [4, 6, 7]
    },
    {
      "id": 4,
      "title": "Franky (VSCode)",
      "description": "Efficient developer assistant VSCode extension, supporting dynamic template generation, Tailwind style auto-conversion, and file header auto-commenting, greatly improving development efficiency and consistency across multiple frameworks.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035c8e0d607.webp",
      "technologies": ["TypeScript", "VSCode API", "Template Engine", "Tailwind CSS"],
      "techIds": ["typescript", "vscode", "template", "tailwind"],
      "liveLink": "https://marketplace.visualstudio.com/items?itemName=NorthSeacoder.franky",
      "repoLink": "https://github.com/NorthSeacoder/franky",
      "featured": true,
      "evolution": ["fileheader", "Tailwind Conversion", "Template System", "Dynamic Templates"],
      "related": [7]
    },
    {
      "id": 5,
      "title": "WebBar (VSCode)",
      "description": "Lightweight VSCode status bar custom button plugin, one-click integration of frequently used websites, internal systems, and workflow resources, improving development convenience and context switching efficiency.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035dec4bed3.webp",
      "technologies": ["TypeScript", "VSCode API", "WebView"],
      "techIds": ["typescript", "vscode", "webview"],
      "liveLink": "https://marketplace.visualstudio.com/items?itemName=NorthSeacoder.webbar",
      "repoLink": "https://github.com/NorthSeacoder/webbar",
      "featured": false,
      "evolution": ["Fixed Links", "Custom Configuration"],
      "related": [4]
    },
    {
      "id": 6,
      "title": "CodeTransformer (VSCode)",
      "description": "Professional code migration and refactoring VSCode plugin, integrating multi-level AST analysis, dependency visualization, and batch repair solutions, significantly improving the efficiency and reliability of large project technology upgrades, batch migration, and structural governance.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035e78c6dd6.webp",
      "technologies": ["TypeScript", "Babel", "AST", "Dependency Analysis"],
      "techIds": ["typescript", "babel", "ast", "dependency-analysis"],
      "liveLink": "https://marketplace.visualstudio.com/items?itemName=NorthSeacoder.codetransformer",
      "repoLink": "https://github.com/NorthSeacoder/codetransformer",
      "featured": true,
      "evolution": ["Chinese Search", "Dependency Graph Search", "Custom Extension Support"],
      "related": [3, 7]
    },
    {
      "id": 7,
      "title": "@nsea/depseeker",
      "description": "Deep dependency analysis and recursive scanning tool, supporting complex dependency panorama parsing and alias resolution, assisting large project refactoring and micro-frontend architecture design, improving project structure transparency and collaborative development efficiency.",
      "image": "https://img.mengpeng.tech/i/2025/04/19/68035efb9ffe6.webp",
      "technologies": ["Node.js", "TypeScript", "Dependency Analysis", "AST"],
      "techIds": ["nodejs", "typescript", "dependency-analysis", "ast"],
      "liveLink": "https://www.npmjs.com/package/@nsea/depseeker",
      "repoLink": "https://github.com/NorthSeacoder/depseeker",
      "featured": true,
      "evolution": ["Simple Dependency Resolution", "Dependency Graph Parsing", "Alias Resolution Support"],
      "related": [2, 6]
    }
  ],
  "personal": {
    "name": "Meng Peng",
    "city": "Beijing",
    "email": "mengpeng_bj@foxmail.com",
    "mobile": "18505280124",
    "wechat": "north-sea-coder"
  }
}